<template>
  <TemplatePage>
    <div class="news">
      <div class="news-title">
        <h1>Новини в Fanvox</h1>
      </div>
      <img :src="require(`../assets/img/news/persona_start.jpg`)" alt="persona_start.jpg">
      <p>🔴 Персона 4 / Persona 4 The Animation (cерія 1 з 25)<br>
        🔶 Епізод 1 - Ти - це я, а я - це ти<br>
        🔶 Сюжет:
        Коли Нарукамі Юу переїжджає до віддаленого містечка Інаба, він очікує набагато більше тиші та спокою, ніж він звик у великому місті. Натомість тишу було зруйновано, і єдиною тишею стала тиша могили, коли містечко охопила низка таємничих убивств і викрадень. Поліція загнана в глухий кут і Юу приєднується до групи з восьми інших підлітків у відчайдушній спробі розгадати таємницю. Таємниця якимось чином пов’язана як з місцевими погодними умовами і з дивним світом відеоігор, у який можуть потрапити Юу, його друзі та загадковий вбивця. Це місце, де кожен повинен володіти унікальною зброєю та навчитися використовувати дивовижні сили, якщо хоче вижити.<br>
      </p>
      <div class="post-time">
        <p>07.06.2023 23:39</p>
      </div>
      <hr>
      <p>Ну що ж, друзі, до прийдешнього літнього аніме-сезону лишається трохи більше місяця, а ми вже готові анонсувати його 🙂<br>

        🔴 Магічна битва / Jujutsu Kaisen (2 сезон)<br>
        Опису не потребує.<br>
        Дата початку трансляції: 06.07<br>
        Трейлер: <a href="https://www.youtube.com/watch?v=aybr_9MzKXI">https://www.youtube.com/watch?v=aybr_9MzKXI</a><br>

        🔴 Реінкарнція безробітного / Mushoku Tensei (2 сезон)<br>
        Опису не потребує.<br>
        Дата початку трансляції: 03.07<br>
        Трейлер: <a href="https://www.youtube.com/watch?v=mX4KwYYqEhI">https://www.youtube.com/watch?v=mX4KwYYqEhI</a><br>

        🔴 Літературні генії Бродячі Пси / Bungo Stray Dogs (5 сезон)<br>
        Опису не потребує.<br>
        Дата початку трансляції: липень<br>
        Трейлер: <a href="https://www.youtube.com/watch?v=H-CcrNN3xG4">https://www.youtube.com/watch?v=H-CcrNN3xG4</a><br>

        🔴 Гелк / Helck<br>
        Опис: У певній країні світу демонів один з героїв переміг короля демонів і розпочалось змагання для визначення нового. Четверо імперських небесних королів Верміліо, які керували турніром, надзвичайно розлютились через участь героя людей Гелка, який би мав бути ворогом короля демонів. Отримавши новину про падіння замку Урум перед фіналом, Верміліо збираються відвоювати його разом з Гелком та іншими фіналістами. З посмішкою на вустах Гелк промовляє: "Давайте знищимо людей". Чи правдиві ці слова? Істина, що криється за посмішкою, це...<br>
        Дата початку трансляції: 11.07<br>
        Трейлер: <a href="https://www.youtube.com/watch?v=4JchyXdAHZY">https://www.youtube.com/watch?v=4JchyXdAHZY</a><br>

        🔴 Кіт-домогосподар нині знов не в гуморі / Dekiru Neko wa Kyou mo Yuuutsu<br>
        Опис: Саку — звичайна молода жінка, яка багато працює і живе одна зі своїм котом Юкічі. Однак, Юкічі не звичайний домашній кіт. Мало того, що темпераментний котяра вищий ніж Саку, він ще й ходить на двох лапах. Замість того, щоб гратися з іграшковими мишками, він шукає знижки в супермаркетах і прибирає у домі. У такій ситуації важко сказати, хто про кого піклується!<br>
        Дата початку трансляції: 07.07<br>
        Трейлер: <a href="https://www.youtube.com/watch?v=0DcwWbpC4eU">https://www.youtube.com/watch?v=0DcwWbpC4eU</a><br>

        🔴 Зом 100: Сотня справ, які треба зробити перш, ніж стати зомбаком / Zom 100: Zombie ni Naru made ni Shitai 100 no Koto<br>
        Опис: В засміченій квартирі, 24-ох річний Акіра Тендо дивиться кіно про зомбі пустим трохи заздрісним поглядом. Після трьох важких років рабської праці на корпорацію в Японії, він абсолютно виснажений. Він навіть не може набратись сміливості, щоб зізнатись в коханні прекрасній співробітниці Ооторі. Одного ранку він натрапляє на свого орендодавця, який виявляється кимось зовсім іншим. Все місто кишить зомбі, а Акіра, тікаючи та рятуючи своє життя, ще ніколи не відчував себе таким живим!<br>
        Дата початку трансляції: 09.07<br>
        Трейлер: <a href="ttps://www.youtube.com/watch?v=l2mag0-sn80">ttps://www.youtube.com/watch?v=l2mag0-sn80</a><br>

        А для охочих замовити щось, що не ввійшло в цей список - наші двері завжди відкриті 😉</p>
      <div class="post-time">
        <p>29.06.2023 17:04</p>
      </div>
      <hr>
      <img :src="require(`../assets/img/news/kimetsu_next.jpg`)" alt="kimetsu_next.jpg">
      <p>Нова серія "Клинка, який знищує демонів" вже перекладається, серія просто карколомна 🤪
        Потішити вас її озвучкою плануємо як зазвичай завтра вдень 👌</p>
      <div class="post-time">
        <p>04.06.2023 21:25</p>
      </div>
      <hr>
      <img :src="require(`../assets/img/news/may_end.jpg`)">
      <p>От і закінчується травень, і до вас поспішає черговий Прикінцевий донат 👌

        Правила не змінилися: за кілька днів до кінця місяця ми викладаємо схожий на цей пост, і тоді:<br>
        🔶 З вас - жирненький донат, як подяка за все що ми для вас озвучили за поточний місяць<br>
        🔷 З нас - зважаючи на кількість донатиків зібраних за ці кілька днів, ми беремо на озвучку щось разове - ОВА, спешл, повнометражка, і озвучуємо на початку наступного місяця, незалежно від наявності інших озвучок на цей матеріал 🙂

        Реалізуємо це через вже звичну форму разової подяки - тільки проханнячко, вказуйте в коментарі що це прикінцевий донат 👌</p>
      <div class="post-time">
        <p>27.05.2023 14:34</p>
      </div>
    </div>
  </TemplatePage>
</template>

<script>
import TemplatePage from "@/components/TemplatePage.vue";

export default {
  name: "NewsView",
  components: {TemplatePage}
}
</script>

<style lang="scss" scoped>

.news-title {
  width: 100%;
  padding: 2px 0 0 2px;
  background-color: $bloody-red;

  text-align: center;
  color: white;
  text-transform: uppercase;
}

.news {
  text-align: left;
  max-width: 1280px;
  margin: 0 auto;
  background-color: $light-gray;
  position: center;

  animation-name: smooth-appear;
  animation-duration: 0.2s;

  .post-time {
    text-align: right;
  }

  p, a {
    font-size: 18px;
  }
}

img {
  max-width: 100%;
  width: 100%;
  height: auto;
}

</style>