<template>
  <div class="ongoing-grid">
    <div v-for="image in images" class="tile">
      <img :src="require(`../assets/img/tiles/${image.title}`)" alt="{{ image.title }}">
      <p class="description">{{image.desc}}</p>
    </div>
  </div>
</template>

<script>

export default {
  name: "OngoingGrid",
  data() {
    return {
      images: [
        { title: "1big.jpg", name: "Пеклорай", desc: "Період Едо добігає кінця. Ґабімару, шінобі, який раніше був відомий як найсильніший в Іваґакуре, а тепер засуджений до смертної кари, виборов собі свободу, за умови що він зможе повернути Настій Життя з острова, який, за чутками, є святинею для буддистів Сухаваті. У надії возз'єднатися з коханою дружиною, Ґабімару вирушає на острів разом із катом Ямадою Асаемон Саґірі. Прибувши туди, вони зустрічають інших засуджених до смертної кари у пошуках настою життя... а також безліч невідомих істот, моторошних рукотворних статуй і відлюдників, які правлять островом."},
        { title: "2big.jpg", name: "Літнє кафе та його богині", desc: "У спадок від бабусі Хаято отримав будинок та стареньке кафе на березі моря. Проте за відсутності хлопця бабуся прихистила вдома 5 гарненьких самотніх дівчат, які зовсім не збираються кудись йти лише тому що власник будинку змінився. І що з ними робити молодому самотньому хлопцю?"},
        { title: "3big.jpg", name: "Клинок, який знищує демонів 3", desc: "Продовження однойменного тайтлу."},
        { title: "4big.jpg", name: "Цей прекрасний світ, благословлений вибухом", desc: "Приквел-спіноф легендарної \"Коносуби\". Це - історія про архімага, яку називали як неймовірною, так і скаженою шанувальницею магії вибуху, до того, як вона зустріла справжніх друзів, про Меґумін."},
        { title: "5big.jpg", name: "Коли плачуть чайки", desc: "Події відбуваються на острові Роккенджіма, що належить заможній родині Ушіромія. За традицією щороку вся родина збирається на острові обговорити поточне фінансове становище кожного. Через слабке здоров'я голови цього року мова йде про спадок та про його розподіл. Однак родина не знає, що розподіл його багатства є найменшою проблемою для Ушіромії Кінзо цього разу. Після того як його давній друг і лікар повідомив, що жити йому лишилося три місяці, Кінзо відчайдушно хоче востаннє зустріти справжнє кохання свого життя: золоту відьму Беатріс. Занурившись у чорну магію протягом багатьох останніх років свого життя, Кінзо розпочинає церемонію повернення своєї коханої після прибуття його родини на Роккенджіму. Незабаром після цього тайфун затримує родину на острові, і починається серія таємничих убивств, що змушує вісімнадцятьох людей на острові боротися за своє життя у смертельній боротьбі між фантазією та реальністю."},
      ]
    }
  },
}
</script>

<style lang="scss" scoped>

.ongoing-grid {
  padding: 1vh 2vw;
  display: grid;
  grid-template-columns: repeat(4, 1fr);
  gap: 5px;
}

.tile {
  position: relative;


  img {
    max-width: 100%;
    display: block;

    width: 320px;
    height: auto;
  }

  .description {
    position: absolute;
    padding: 7px;
    top: 0;
    bottom: 0;
    left: 0;
    right: 0;
    opacity: 0;
    color: $light-gray;
    visibility: hidden;

    text-overflow: ellipsis;
    overflow: hidden;

    transition-property: visibility, background-color, opacity;
    transition: 400ms linear;
  }

}

.tile:hover .description {
  background-color: rgba(0, 0, 0, .5);
  visibility: visible;
  opacity: 1;
}

</style>